lkolbly/cmsis-svd/data/TexasInstruments/LM3S817.svd
        <register>
          <name>PRI2</name>
          <description>Interrupt 8-11 Priority</description>
          <addressOffset>0x00000408</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI2_INT8</name>
              <description>Interrupt 8 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT9</name>
              <description>Interrupt 9 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT10</name>
              <description>Interrupt 10 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI2_INT11</name>
              <description>Interrupt 11 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI3</name>
          <description>Interrupt 12-15 Priority</description>
          <addressOffset>0x0000040C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI3_INT12</name>
              <description>Interrupt 12 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT13</name>
              <description>Interrupt 13 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT14</name>
              <description>Interrupt 14 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI3_INT15</name>
              <description>Interrupt 15 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI4</name>
          <description>Interrupt 16-19 Priority</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI4_INT16</name>
              <description>Interrupt 16 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT17</name>
              <description>Interrupt 17 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT18</name>
              <description>Interrupt 18 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI4_INT19</name>
              <description>Interrupt 19 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI5</name>
          <description>Interrupt 20-23 Priority</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI5_INT20</name>
              <description>Interrupt 20 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT21</name>
              <description>Interrupt 21 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT22</name>
              <description>Interrupt 22 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI5_INT23</name>
              <description>Interrupt 23 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI6</name>
          <description>Interrupt 24-27 Priority</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI6_INT24</name>
              <description>Interrupt 24 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT25</name>
              <description>Interrupt 25 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT26</name>
              <description>Interrupt 26 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI6_INT27</name>
              <description>Interrupt 27 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI7</name>
          <description>Interrupt 28-31 Priority</description>
          <addressOffset>0x0000041C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI7_INT28</name>
              <description>Interrupt 28 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT29</name>
              <description>Interrupt 29 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT30</name>
              <description>Interrupt 30 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI7_INT31</name>
              <description>Interrupt 31 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>CPU ID Base</description>
          <addressOffset>0x00000D00</addressOffset>
          <fields>
            <field>
              <name>NVIC_CPUID_REV</name>
              <description>Revision Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_PARTNO</name>
              <description>Part Number</description>
              <bitRange>[15:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_PARTNO_CM3</name>
                  <description>Cortex-M3 processor</description>
                  <value>0xc23</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_CPUID_CON</name>
              <description>Constant</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_VAR</name>
              <description>Variant Number</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_IMP</name>
              <description>Implementer Code</description>
              <bitRange>[31:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_IMP_ARM</name>
                  <description>ARM</description>
                  <value>0x41</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CTRL</name>
          <description>Interrupt Control and State</description>
          <addressOffset>0x00000D04</addressOffset>
          <fields>
            <field>
              <name>NVIC_INT_CTRL_VEC_ACT</name>
              <description>Interrupt Pending Vector Number</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_RET_BASE</name>
              <description>Return to Base</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_VEC_PEN</name>
              <description>Interrupt Pending Vector Number</description>
              <bitRange>[17:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_HARD</name>
                  <description>Hard fault</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_MEM</name>
                  <description>Memory management fault</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_BUS</name>
                  <description>Bus fault</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_USG</name>
                  <description>Usage fault</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_SVC</name>
                  <description>SVCall</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_PNDSV</name>
                  <description>PendSV</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_INT_CTRL_VEC_PEN_TICK</name>
                  <description>SysTick</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_INT_CTRL_ISR_PEND</name>
              <description>Interrupt Pending</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_ISR_PRE</name>
              <description>Debug Interrupt Handling</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PENDSTCLR</name>
              <description>SysTick Clear Pending</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PENDSTSET</name>
              <description>SysTick Set Pending</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_UNPEND_SV</name>
              <description>PendSV Clear Pending</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_PEND_SV</name>
              <description>PendSV Set Pending</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>NVIC_INT_CTRL_NMI_SET</name>
              <description>NMI Set Pending</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VTABLE</name>
          <description>Vector Table Offset</description>
          <addressOffset>0x00000D08</addressOffset>
          <fields>
            <field>
              <name>NVIC_VTABLE_OFFSET</name>
              <description>Vector Table Offset</description>
              <bitRange>[28:8]</bitRange>
            </field>
            <field>
              <name>NVIC_VTABLE_BASE</name>
              <description>Vector Table Base</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APINT</name>
          <description>Application Interrupt and Reset Control</description>
          <addressOffset>0x00000D0C</addressOffset>
          <fields>
            <field>
              <name>NVIC_APINT_VECT_RESET</name>
              <description>System Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_APINT_VECT_CLR_ACT</name>
              <description>Clear Active NMI / Fault</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_APINT_SYSRESETREQ</name>
              <description>System Reset Request</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_APINT_PRIGROUP</name>
              <description>Interrupt Priority Grouping</description>
              <bitRange>[10:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_7_1</name>
                  <description>Priority group 7.1 split</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_6_2</name>
                  <description>Priority group 6.2 split</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_5_3</name>
                  <description>Priority group 5.3 split</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_4_4</name>
                  <description>Priority group 4.4 split</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_3_5</name>
                  <description>Priority group 3.5 split</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_2_6</name>
                  <description>Priority group 2.6 split</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_1_7</name>
                  <description>Priority group 1.7 split</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_APINT_PRIGROUP_0_8</name>
                  <description>Priority group 0.8 split</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_APINT_ENDIANESS</name>
              <description>Data Endianess</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NVIC_APINT_VECTKEY</name>
              <description>Register Key</description>
              <bitRange>[31:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_VECTKEY</name>
                  <description>Vector key</description>
                  <value>0x5fa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <description>System Control</description>
          <addressOffset>0x00000D10</addressOffset>
          <fields>
            <field>
              <name>NVIC_SYS_CTRL_SLEEPEXIT</name>
              <description>Sleep on ISR Exit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_CTRL_SLEEPDEEP</name>
              <description>Deep Sleep Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_CTRL_SEVONPEND</name>
              <description>Wake Up on Pending</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_CTRL</name>
          <description>Configuration and Control</description>
          <addressOffset>0x00000D14</addressOffset>
          <fields>
            <field>
              <name>NVIC_CFG_CTRL_BASE_THR</name>
              <description>Thread State Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_MAIN_PEND</name>
              <description>Allow Main Interrupt Trigger</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_UNALIGNED</name>
              <description>Trap on Unaligned Access</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_DIV0</name>
              <description>Trap on Divide by 0</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_BFHFNMIGN</name>
              <description>Ignore Bus Fault in NMI and Fault</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_CFG_CTRL_STKALIGN</name>
              <description>Stack Alignment on Exception Entry</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI1</name>
          <description>System Handler Priority 1</description>
          <addressOffset>0x00000D18</addressOffset>
          <fields>
            <field>
              <name>NVIC_SYS_PRI1_MEM</name>
              <description>Memory Management Fault Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_PRI1_BUS</name>
              <description>Bus Fault Priority</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_PRI1_USAGE</name>
              <description>Usage Fault Priority</description>
              <bitRange>[23:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI2</name>
          <description>System Handler Priority 2</description>
          <addressOffset>0x00000D1C</addressOffset>
          <fields>
            <field>
              <name>NVIC_SYS_PRI2_SVC</name>
              <description>SVCall Priority</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_PRI3</name>
          <description>System Handler Priority 3</description>
          <addressOffset>0x00000D20</addressOffset>
          <fields>
            <field>
              <name>NVIC_SYS_PRI3_DEBUG</name>
              <description>Debug Priority</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_PRI3_PENDSV</name>
              <description>PendSV Priority</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_PRI3_TICK</name>
              <description>SysTick Exception Priority</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_HND_CTRL</name>
          <description>System Handler Control and State</description>
          <addressOffset>0x00000D24</addressOffset>
          <fields>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEMA</name>
              <description>Memory Management Fault Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUSA</name>
              <description>Bus Fault Active</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USGA</name>
              <description>Usage Fault Active</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_SVCA</name>
              <description>SVC Call Active</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MON</name>
              <description>Debug Monitor Active</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_PNDSV</name>
              <description>PendSV Exception Active</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_TICK</name>
              <description>SysTick Exception Active</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USAGEP</name>
              <description>Usage Fault Pending</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEMP</name>
              <description>Memory Management Fault Pending</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUSP</name>
              <description>Bus Fault Pending</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_SVC</name>
              <description>SVC Call Pending</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_MEM</name>
              <description>Memory Management Fault Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_BUS</name>
              <description>Bus Fault Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_SYS_HND_CTRL_USAGE</name>
              <description>Usage Fault Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
